# ตัวดำเนินการทางคณิตศาสตร์ (Arithmetic Operators)
# การบวก (+)
a = 5
b = 3
c = a + b
print("ผลบวกของ", a, "และ", b, "คือ", c) # ผลลัพธ์คือ 8
print("____________________________________________________________________________________")
# การลบ (-)
d = a - b
print("ผลลบของ", a, "และ", b, "คือ", d) # ผลลัพธ์คือ 2
print("____________________________________________________________________________________")
# การคูณ (*)
e = a * b
print("ผลคูณของ", a, "และ", b, "คือ", e) # ผลลัพธ์คือ 15
print("____________________________________________________________________________________")
# การหาร (/)
f = a / b
print("ผลหารของ", a, "และ", b, "คือ", f) # ผลลัพธ์คือ 1.6666666666666667
print("____________________________________________________________________________________")
# การหารเอาเศษ (%)
g = a % b
print("ผลหารเอาเศษของ", a, "และ", b, "คือ", g) # ผลลัพธ์คือ 2
print("____________________________________________________________________________________")
# การยกกำลัง (**)
h = a ** b
print("ผลยกกำลังของ", a, "และ", b, "คือ", h) # ผลลัพธ์คือ 125
print("____________________________________________________________________________________")
# การหารเอาเศษและปัดเศษลง (//)
i = a // b
print("ผลหารเอาเศษและปัดเศษลงของ", a, "และ", b, "คือ", i) # ผลลัพธ์คือ 1
print("____________________________________________________________________________________")

# ตัวดำเนินการกำหนดค่า (Assignment Operators)
x, y = 10, 2

print("x =", x)
print("y =", y)

x += y  # x = x + y
print("หลังจาก x += y, x =", x) # ผลลัพธ์คือ 12
x -= y  # x = x - y

x *= y  # x = x * y

x /= y  # x = x / y

x %= y  # x = x % y

x **= y  # x = x ** y

# ตัวดำเนินการเปรียบเทียบ (Comparison Operators)
# ==  เท่ากัน
# !=  ไม่เท่ากัน
# >   มากกว่า
# <   น้อยกว่า
# >=  มากกว่าหรือเท่ากัน
# <=  น้อยกว่าหรือเท่ากัน
m, n = 100, 50

print(m == n)  # ผลลัพธ์คือ False
print(m != n)  # ผลลัพธ์คือ True
print(m > n)   # ผลลัพธ์คือ True
print(m < n)   # ผลลัพธ์คือ False
print(m >= n)  # ผลลัพธ์คือ True
print(m <= n)  # ผลลัพธ์คือ False