# ตัวดำเนินการทางคณิตศาสตร์ (Arithmetic Operators)
# การบวก (+)
a = 5
b = 3
c = a + b
print("ผลบวกของ", a, "และ", b, "คือ", c) # ผลลัพธ์คือ 8
print("____________________________________________________________________________________")
# การลบ (-)
d = a - b
print("ผลลบของ", a, "และ", b, "คือ", d) # ผลลัพธ์คือ 2
print("____________________________________________________________________________________")
# การคูณ (*)
e = a * b
print("ผลคูณของ", a, "และ", b, "คือ", e) # ผลลัพธ์คือ 15
print("____________________________________________________________________________________")
# การหาร (/)
f = a / b
print("ผลหารของ", a, "และ", b, "คือ", f) # ผลลัพธ์คือ 1.6666666666666667
print("____________________________________________________________________________________")
# การหารเอาเศษ (%)
g = a % b
print("ผลหารเอาเศษของ", a, "และ", b, "คือ", g) # ผลลัพธ์คือ 2
print("____________________________________________________________________________________")
# การยกกำลัง (**)
h = a ** b
print("ผลยกกำลังของ", a, "และ", b, "คือ", h) # ผลลัพธ์คือ 125
print("____________________________________________________________________________________")
# การหารเอาเศษและปัดเศษลง (//)
i = a // b
print("ผลหารเอาเศษและปัดเศษลงของ", a, "และ", b, "คือ", i) # ผลลัพธ์คือ 1
print("____________________________________________________________________________________")

# ตัวดำเนินการกำหนดค่า (Assignment Operators)
x, y = 10, 5

print("x =", x)
print("y =", y)